# Даны три числа: 130, 25 и 70. Выведите на экран наименьшее из них

first_value, second_value, third_value = 130, 25, 70

print(f"Минимальное число = {min(first_value, second_value, third_value)}")